pascal-4.0/tutorials/multiPhysics/buoyantBoussinesqPimpleEddyCurrentFoam/tubafSi2Daxi/constant/region_fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel        Newtonian;

nu                    nu  [ 0 2 -1 0 0 0 0 ] 3.3333e-7; // SiLiquid

beta                  beta [0 0 0 -1 0 0 0] 1e-04;

Pr                    Pr [0 0 0 0 0 0 0] 0.0122;

Prt                   Prt [0 0 0 0 0 0 0] 0.85;

TRef                  TRef [0 0 0 1 0 0 0] 0;

rhoRef                rhoRef [ 1 -3  0 0 0 0 0 ] 2580;     // SiLiquid

CpRef                 CpRef [ 0 2 -2 -1 0 0 0 ] 943;     // SiLiquid

// ************************************************************************* //

